#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.python_file: Reading...
data.archive_file.python_file: Read complete after 0s [id=efca5ba5d15c470502277886d6f89aea9b62262c]
module.vpc.data.aws_iam_policy_document.assume_role: Reading...
module.vpc.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2717921857]
module.vpc.data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.encryption_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "encryption_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Decrypt",
              + "kms:Delete*",
              + "kms:DescribeKey",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:Get*",
              + "kms:List*",
              + "kms:Put*",
              + "kms:ReEncrypt*",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "Enable IAM User Permissions"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::743794601996:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "Allow CloudWatch to use the key"

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:logs:us-east-2:743794601996:log-group:/aws/lambda/app-7*",
                ]
              + variable = "kms:EncryptionContext:aws:logs:arn"
            }

          + principals {
              + identifiers = [
                  + "logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "Allow Lambda to use the key"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "Allow SSM to use the key"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "743794601996",
                ]
              + variable = "kms:CallerAccount"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ssm.us-east-2.amazonaws.com",
                ]
              + variable = "kms:ViaService"
            }

          + principals {
              + identifiers = [
                  + "ssm.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_event_rule.lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "lambda_trigger" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "app-7-lambda-trigger-rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(10 minutes)"
      + tags_all            = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
    }

  # aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "app-7-lambda-trigger-rule"
      + target_id      = "lambda_target"
    }

  # aws_cloudwatch_log_group.lambda_log will be created
  + resource "aws_cloudwatch_log_group" "lambda_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/app-7"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
    }

  # aws_cloudwatch_log_stream.log_stream will be created
  + resource "aws_cloudwatch_log_stream" "log_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/app-7"
      + name           = "app-7-lambda-log-stream"
    }

  # aws_iam_policy.lambda_policy will be created
  + resource "aws_iam_policy" "lambda_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "AWS IAM policy for the lambda role."
      + id               = (known after apply)
      + name             = "app-7-lambda-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
    }

  # aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-7-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_policy_attachement will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attachement" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "app-7-lambda-role"
    }

  # aws_iam_role_policy_attachment.managed_vpc_policy_attachement will be created
  + resource "aws_iam_role_policy_attachment" "managed_vpc_policy_attachement" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "app-7-lambda-role"
    }

  # aws_kms_alias.encryption will be created
  + resource "aws_kms_alias" "encryption" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/app-7"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.encryption will be created
  + resource "aws_kms_key" "encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "Key to encrypt all the cloud resources in app-7."
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
    }

  # aws_kms_key_policy.encryption will be created
  + resource "aws_kms_key_policy" "encryption" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = (known after apply)
    }

  # aws_lambda_code_signing_config.configuration will be created
  + resource "aws_lambda_code_signing_config" "configuration" {
      + arn           = (known after apply)
      + config_id     = (known after apply)
      + id            = (known after apply)
      + last_modified = (known after apply)

      + allowed_publishers {
          + signing_profile_version_arns = (known after apply)
        }

      + policies {
          + untrusted_artifact_on_deployment = "Enforce"
        }
    }

  # aws_lambda_function.lambda_run will be created
  + resource "aws_lambda_function" "lambda_run" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + code_signing_config_arn        = (known after apply)
      + filename                       = "./lambda_function/lambda_function.zip"
      + function_name                  = "app-7"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = 5
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "r/IEcoyUiZqdbjpfqNbrR03Z+f3qKrwjwkDn/9yI5Wo="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "log_group_name"  = "/aws/lambda/app-7"
              + "log_stream_name" = "app-7-lambda-log-stream"
              + "parameter_name"  = "/app-7"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config {
          + log_format       = "JSON"
          + log_group        = "/aws/lambda/app-7"
          + system_log_level = "INFO"
        }

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = (known after apply)
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "app-7"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # aws_security_group.endpoint_sg will be created
  + resource "aws_security_group" "endpoint_sg" {
      + arn                    = (known after apply)
      + description            = "allow inbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "endpoint_access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-7-endpoint-sg"
        }
      + tags_all               = {
          + "Name"   = "app-7-endpoint-sg"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lambda will be created
  + resource "aws_security_group" "lambda" {
      + arn                    = (known after apply)
      + description            = "Security group for Lambda in app-7"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "app-7-lambda-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-7-lambda-sg"
        }
      + tags_all               = {
          + "Name"   = "app-7-lambda-sg"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.egress_vpc_endpoint_lambda will be created
  + resource "aws_security_group_rule" "egress_vpc_endpoint_lambda" {
      + description              = "allow traffic from vpc-endpoint to reach lambda"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.ingress_vpc_endpoint will be created
  + resource "aws_security_group_rule" "ingress_vpc_endpoint" {
      + cidr_blocks              = [
          + "12.25.15.0/25",
        ]
      + description              = "Enable access for the endpoints."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_signer_signing_profile.lambda_signing_profile will be created
  + resource "aws_signer_signing_profile" "lambda_signing_profile" {
      + arn                   = (known after apply)
      + id                    = (known after apply)
      + name                  = "app_7_lambda_signing_profile"
      + name_prefix           = (known after apply)
      + platform_display_name = (known after apply)
      + platform_id           = "AWSLambda-SHA384-ECDSA"
      + revocation_record     = (known after apply)
      + status                = (known after apply)
      + tags_all              = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + version               = (known after apply)
      + version_arn           = (known after apply)

      + signature_validity_period (known after apply)

      + signing_material (known after apply)
    }

  # aws_sqs_queue.dlq will be created
  + resource "aws_sqs_queue" "dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "app-7-lambda-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_ssm_parameter.parameter will be created
  + resource "aws_ssm_parameter" "parameter" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/app-7"
      + tags_all       = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_vpc_endpoint.logs will be created
  + resource "aws_vpc_endpoint" "logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-2.logs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "app-7-logs"
        }
      + tags_all              = {
          + "Name"   = "app-7-logs"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)
    }

  # aws_vpc_endpoint.ssm will be created
  + resource "aws_vpc_endpoint" "ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-2.ssm"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "app-7-ssm"
        }
      + tags_all              = {
          + "Name"   = "app-7-ssm"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)
    }

  # module.vpc.data.aws_iam_policy_document.vpc_flow_log_policy_document[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_flow_log_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.vpc.aws_cloudwatch_log_group.network_flow_logging[0] will be created
  + resource "aws_cloudwatch_log_group" "network_flow_logging" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "app-7-flow-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
    }

  # module.vpc.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-7-default"
        }
      + tags_all               = {
          + "Name"   = "app-7-default"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_flow_log.network_flow_logging[0] will be created
  + resource "aws_flow_log" "network_flow_logging" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Name" = "app-7-flow-logs"
        }
      + tags_all                 = {
          + "Name"   = "app-7-flow-logs"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.vpc.aws_iam_role.vpc_flow_log_role[0] will be created
  + resource "aws_iam_role" "vpc_flow_log_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-7-vpc-flow-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.vpc.aws_iam_role_policy.vpc_flow_log_role_policy[0] will be created
  + resource "aws_iam_role_policy" "vpc_flow_log_role_policy" {
      + id          = (known after apply)
      + name        = "app-7-vpc-flow-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.vpc.aws_kms_alias.key[0] will be created
  + resource "aws_kms_alias" "key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/app-7-encrypt-flow-log"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.vpc.aws_kms_key.custom_kms_key[0] will be created
  + resource "aws_kms_key" "custom_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for app-7"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
    }

  # module.vpc.aws_kms_key_policy.encrypt_log[0] will be created
  + resource "aws_kms_key_policy" "encrypt_log" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "app-7-flow-log-encryption"
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::743794601996:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncryptFrom",
                          + "kms:ReEncryptTo",
                          + "kms:GenerateDataKey",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + "kms:EncryptionContext:aws:logs:arn" = [
                                  + "arn:aws:logs:us-east-2:743794601996:log-group:app-7-flow-logs",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowCloudWatchLogsEncryption"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "app-7-private-1"
        }
      + tags_all         = {
          + "Name"   = "app-7-private-1"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "app-7-private-2"
        }
      + tags_all         = {
          + "Name"   = "app-7-private-2"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "app-7-private-3"
        }
      + tags_all         = {
          + "Name"   = "app-7-private-3"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.25.15.0/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "app-7-private-1"
        }
      + tags_all                                       = {
          + "Name"   = "app-7-private-1"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.25.15.32/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "app-7-private-2"
        }
      + tags_all                                       = {
          + "Name"   = "app-7-private-2"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.25.15.64/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "app-7-private-3"
        }
      + tags_all                                       = {
          + "Name"   = "app-7-private-3"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "12.25.15.0/25"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "app-7"
        }
      + tags_all                             = {
          + "Name"   = "app-7"
          + "Source" = "https://github.com/kunduso/add-aws-lambda-terraform"
        }
    }

Plan: 41 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*